if __name__ == "__main__":
    # Write your solution here
    a = int(input("Введите любое число: "))
    b = int(input("Введите любое число: "))
    c = int(input("Введите любое число: "))

    list_ = [a, b, c]
    print("Минимальное из введенных чисел: ", min(list_))
# Напишите ваше решение
